Repository: OpenMandrivaSoftware/abf-console-client
Catalog: po/*.po
Languages: ru

source: File with hash %s can not be downloaded from File-Store.
ru: Файл с хэш-суммой %s не может быть скачан с файлового хранилища.

source: Error while downloading file by hash %(hash)s: %(exception)s
ru: Ошибка при скачивании файла по хэш-сумме %(hash)s: %(exception)s
