Repository: OpenMandrivaSoftware/abf-console-client
Catalog: po/*.po
Languages: ru

source: At least one of 'ID' or 'init_data' parameters have to be set!
ru: Должен быть задан хотя бы один из параметров: 'ID', 'init_data'

source: Key 'id' have to present in initial data!
ru: Ключ 'id' должен присутсвовать в начальных данных!

source: Loading %(name)s %(id)s from cache
ru: Загружается %(name)s %(id)s из кэша

source: Loading %(name)s %(id)s using API
ru: Загружается %(name)s %(id)s с использованием API

source: Results were cached
ru: Результаты помещены в кэш

source: One of the fields required for %(name)s model was not specified: %(field)s
ru: Не задано одно из полей, необходимых для модели %(name)s: %(field)s

source: Creating a stub for %(name)s %(id)s
ru: Создается заглушка для %(name)s %(id)s

source: Key '%s' can not be found!
ru: Ключ '%s' не найден!

source: Reading platform
ru: Чтение данных о платформе

source: Reading repository
ru: Чтение данных о репозитории

source: Reading arch
ru: Чтение данных об архитектуре

source: Architecture with id %s not found!
ru: Архитектура с идентификатором %s не найдена!

source: Reading user
ru: Чтение данных о пользователе

source: Reading group
ru: Чтение данных о группе

source: Reading project
ru: Чтение данных о проекте

source: Invalid key:
ru: Неверный ключ:

source: Updating project settings:
ru: Обновляем настройки проекта:

source: Sorry, but something went wrong and request I've sent to ABF is bad. Please, notify the console-client developers. Send them a set of command-line arguments and the request data: %s
ru: Что-то пошло не так и на ABF был отправлен некорректный запрос. Пожалуйста, сообщите об этом разработчикам консольного клиента. Пошлите им перечень аргументов, с которыми был запущен клиент, и данные запроса: %s

source: Successfully updated settings of project %s.
ru: Настройки проекта %s успешно обновлены.

source: Reading buildlist
ru: Чтение данных о сборочном листе

source: Sending the build task:
ru: Чтение данных о сборочном задании

source: Task %(proj)s|%(plat)s|%(save_repo)s|%(arch)s has been sent. Build task id is %(id)s
ru: Сборочное задание %(proj)s|%(plat)s|%(save_repo)s|%(arch)s успешно запущено. Идентификатор задания - %(id)s

source: Publishing the project %s...
ru: Публикуется проект %s...

source: Sending pull request:
ru: Посылается запрос на изменение (pull request):

source: Pull request from %(proj)s/%(from)s to %(dest_proj)s/%(to)s has been sent.
ru: Запрос на изменений для проекта %(dest_proj)s/%(to)s из %(proj)s/%(from)s успешно создан.

source: Creating project:
ru: Создается проект:

source: The project %(name)s for owner %(owner)d has been created.
ru: Проект %(name)s для владельца %(owner)d успешно создан.

source: Adding project to repository:
ru: Добавляем проект в репозиторий:

source: The project %(project)d has been added to repository %(repo)d.
ru: Проект %(project)d был успешно добавлен в репозиторий %(repo)d.

source: Removing project from repository:
ru: Удаляем проект из репозитория:

source: The project has been removed from repository.
ru: Проект был успешно удален из репозитория.

source: Forking project:
ru: Клонируем проект:

source: The project has been forked.
ru: Проект был успешно склонирован.

source: Creating alias for a project:
ru: Создается алиас для проекта:

source: The project alias has been created.
ru: Алиас для проекта был успешно создан.

source: Destroying project:
ru: Удаляем проект:

source: The project has been destroyed.
ru: Проект был успешно удален.

source: Initializing models for
ru: Инициализируем модели для

source: Incorrect value of 'default_publish_status' in config file, ignoring. Possible valus are:
ru: Некорректное значение параметра 'default_publish_status' в файле конфигурации. Значение проигнорировано. Разрешенные значения параметра:

source: TEST started
ru: Запускается задача TEST

source: Datamodel seems to work fine
ru: Модель данных функционирует корректно

source: ABF Console Client
ru: Консольный клиент ABF

source: be verbose, display even debug messages
ru: подробный режим, выводить отладочные сообщения

source: clear cached information about repositories, platforms, projects, etc.
ru: очистить кэшированную информацию о репозиториях, платформах, проектах и прочем

source: Do not display info messages
ru: Не показывать информационные сообщения

source: show a help for command
ru: показать справку для команды

source: a command to show help for
ru: команда, для которой надо показать справку

source: Manage aliases
ru: Управление синонимами

source: name and alias (not quoted, e. g. "abf alias add sg search groups") for adding, only name for removing.
ru: имя и тело синонима без кавычек (например, "abf alias add sg search groups") для добавления, только имя для удаления.

source: clone a project from ABF
ru: клонировать проект с ABF

source: project name. ([group/]project). If no group specified, it's assumed to be your default group.
ru: имя проекта ([группа/]проект). Если группа не указана, используется группа по умолчанию из настроек консольного клиента.

source: branch to checkout
ru: ветка, на которую надо переключиться

source: Do not update cache with information about project builds.
ru: Не обновлять кэш с информацией о проектах.

source: Upload large binary files to File-Store and update (or create) .abf.yml file. Can also commit and push changes.
ru: Загрузить бинарные файлы в файловое хранилище и добавить информацию о них в файл .abf.yml. При использовании оции -m, также зафиксировать все имеющиеся в Git-репозитории изменения и отправить их на сервер.

source: With this option specified, "git add" for every file, "git commit -m MSG" and "git push" will be executed.
ru: При указании этой опции, будут выполнены команды "git add" для каждого файла, "git commit -m MSG" и "git push".

source: By default, the client does not add new folders to Git. This option will force it to add all new directories.
ru: По умолчанию, клиент не добавляет в Git-репозиторий директории. Данная опция заставит его это делать.

source: By default, the client does not add new binary files to Git. This option will force it to add all new binaries (unless they are uploaded to file store - see below).
ru: По умолчанию, клиент не добавляет в Git-репозиторий бинарные файлы. Данная опция заставит его добавлять новые файлы в Git, даже если эти файлы - бинарные (за исключением случаев, когда файлы загружаются в файловое хранилище - см. ниже).

source: The minimal file size to upload to File-Store. Default is 0B.
ru: Минимальный размер файла для загрузки в файловое хранилище. По умолчанию - 0B.

source: By default files are being removed on uploading. Override this behavior.
ru: По умолчанию файлы удаляются из текущей директории после загрузки в файловое хранилище. Эта опция отменяет такое поведение.

source: By default, console client analyzes spec file and tries to detect which files located in the current folder are really used by the project and uploads only these files to file store. With this option, console client will upload all binary files located in the current folder.
ru: По умолчанию, консольный клиент анализирует spec-файл и загружает в файловое хранилище только те файлы, которые в нем используются. Если указать эту опцию, то в файловое хранилище будут загружены все бинарные файлы из текущей директории.

source: Upload a given file to File-Store. Prints a sha1 hash or error message (with non-zero return code).
ru: Загрузить указанный файл в файловое хранилище. В случае успеха, вывести хэш-сумму (sha1) загруженного файла.

source: Path to file
ru: Путь к файлу

source: Update project settings.
ru: Изменить настройки проекта.

source: Project to show information for (if needed). Format: "[group/]name". If no group specified, default group will be used.
ru: Проект, для которого необходимо показать информацию. Формат: "[группа/]имя". Если группа не указана, используется значение по умоллчанию из настроек.

source: New project name.
ru: Новое имя проекта.

source: Project description.
ru: Версия проекта.

source: Project visibility. Please specify "open" or "hidden".
ru: Видимость (доступность) проекта. Укажите "open" или "hidden".

source: Is project a package. Please specify "true" or "false".
ru: Является ли проект пакетом. Укажите "true" или "false".

source: Project maintainer. You can specify either maintainer id or login.
ru: Мэйнтейнер проекта. Можно указать имя либо идентификатор в ABF.

source: Default branch for the project Git repository.
ru: Ветка по умолчанию для Git-репозитория проекта.

source: Should project issue tracker be enabled. Please specify "true" or "false".
ru: Следует ли включить трекер задач для проекта. Укажите "true" или "false".".

source: Should project wiki be enabled. Please specify "true" or "false".
ru: Следует ли включить вики для проекта. Укажите "true" или "false".

source: Enable/disable publishing 32bit packages into 64bit repository. Please specify "true" or "false".
ru: Включить публикацию 32битных пакетов в 64битный репозиторий. Укажите "true" или "false".

source: Download all the files listed in .abf.yml or file with given hash from File-Store to local directory.
ru: Загрузить все файлы, указанные в .abf.yml, или файл с заданной хэш-суммой из файлового хранилища в текущую директорию.

source: Download file with given hash
ru: Скачать файл с заданной хэш-суммой

source: Limit the list of downloaded files to this file name(s). This option can be specified more than once.
ru: Загржать только файлы с именами, указанных в этой опции. Опция может быть использована несколтко раз.

source: Add remote Git repository and fetch it.
ru: Добить удаленный Git-репозиторий и получить его содержимое.

source: ABF group to fetch from. This value will be also used as the name of remote repository.
ru: Группа, к которой принадлежит удаленный репозиторий. Это же имя будет использовано как имя-алиас репозитория.

source: Project to fetch (by default the same project name is used as the current one).
ru: Имя удаленного репозитория на ABF. По умолчанию используется такое же имя, как у проекта ,в директори которого вы находитесь.

source: show some general information. Bash autocomplete uses it.
ru: отображение общей информации. Используется механизмами автодополнения командной оболочки.

source: The type of information to show
ru: Тип информации для отображения

source: tool can remember the project location and use it for some reasons (abfcd, etc.).
ru: инструмент может запоминать расположение проекта и использовать их для различных целей (например, для перехода в директорию проекта с помощью abfcd).

source: Every interaction with git repository (build, get, put, etc.) updates the cached location of the project (overriding an existing one if needed). For any cached project you can execute "abfcd <project>" and you will cd to the project directory.
ru: Любое действие с Git-репозиторием (кманды build, get, put и так далее) обновляет сохраненное местопоожние проекта (перезаписывая имеющееся значение при необходимости).Вы можете перейти в директорию любого проекта, для которого сохраено местооложения, с помощью команды "abfcf <имя_проекта>".

source: Directory to update locations for. It should be a git repository for "update" and any directory for "update-recursive". If not specified - the current directory will be used
ru: Директория, для которой следует обновить сохраненные местоположения проектов. Это должна быть директория Git-репозитория в случае команды "update" и произвольная директория в случае команды "update-recirsive". Если этот параметр не указан, используется текущая директория.

source: Initiate a build task on ABF.
ru: Запустить сборочное задание на ABF

source: NOTES: API takes git commit hash to build. So client have to resolve it. 1) If you've specified commit hash - it will be used "as is". 2) If you've specified branch or tag name - it will be resolved automatically using ABF API. (the hash of top commit will be used for branch) 3) If you've specified no git commit related options and you've specified a project name - this project's default branch will be used. 4) If you've specified no git commit related options and you've not specified a project name (you have to be in a git repository) - the top remote commit of your current branch will be used.
ru: ПРИМЕЧАНИЯ: Для сборки, программа передает серверу хэш-сумму коммита в Git-репозиторий, который необходимо использовать. 1) Если вы указали при запуска хэш коммита, он используется "как есть". 2) Если вы указали ветку или тэг, то программа автоматически определит соответсвующий им коммит (при указании ветки, будет использован последний коммит в нее) 3) Если вы не указали упомянутых выше значений, но указали имя проекта, то будет использована ветка по умолчанию этого проекта. 4) Если вы не указали ни тэг/ветку/коммит, ни имя проекта, но находитесь внутри директории Git-репозитория проекта, то будет использован последний коммит текущей ветки этого проекта.

source: project name ([group/]project). If no group specified, it is assumed to be your default group. If the option is not specified and you are in a git repository directory - resolve a project name from it.
ru: имя проекта ([группа/]проект), Если группа не указана, используется группа по умолчанию. Если эта опция не указана и команда запускается внутри директории Git-репозитория, то программа попробует автоматически определить значение для опции.

source: branch to build.
ru: ветка, которую надо использвовать для сборки.

source: tag to build.
ru: тэг, который надо использвовать для сборки.

source: commit sha hash to build.
ru: sha-хэш коммита, который надо использвовать для сборки.

source: repository to save results to ([platform/]repository). If no platform part specified, it is assumed to be "<default_group>_personal". If this option is not specified at all, "<default_group>_personal/main" will be used.
ru: репозиторий, в который следует сохранить результаты сборки ([платформа/]рпозиторий). Если платформа не указана, используется значение "<группа_по_умолчанию>_personal". Если опция не указана совсем, используется значение "<группа_по_умолчанию>_personal/main"

source: architectures to build, can be set more than once. If not set - use all the available architectures.
ru: архитектура, для которой следует запустить сборку. Опция может быть указана несолько раз. Есл опция не указана, сборка запускается для всех архитектур целевой платформы.

source: repositories to build with ([platform/]repository). Can be set more than once. If no platform part specified, it is assumed to be your "<default_build_platform>". If no repositories were specified at all, use the "main" repository from save-to platform.
ru: репозитории, которые необходимо подключить при сборке, в формате [платформа/]репозиторий. Опция может быть указана несколько раз. Если платформа не указаа, используется платформа для сборки по умолчанию. Если при запуске сборки не указано ни одного реозитория, используется только репозиторий "main" целевой платформы.

source: build list whose container should be used during the build. Can be specified more than once.
ru: подключить контейнеры указанного сборочного задания. Опция может быть указана более одного раза.

source: deprecated synonym for --auto-publish-status=default.
ru: устаревший синоним для --auto-publish-status=default.

source: enable automatic publishing. Default is "%s".
ru: включить автоматическую публикацию. Значение по умолчанию: "%s".

source: do not use personal repository to resolve dependencies.
ru: не использовать персональный репозиторий для разрешения зависимостей.

source: Include "testing" subrepository.
ru: Подключить репозиторий 'testing'.

source: Do not launch comprehensive tests.
ru: Не запускать дополнительные тесты.

source: enable automatic creation of container
ru: включить автоматическое создание контейнера

source: do NOT use cached chroot for the build
ru: не используйте кэшированную среду для сборки

source: save build chroot in case of failure
ru: сохранить сборочное окружение в случае ошибки сборки

source: Update type. Default is "%s".
ru: Тип обновления По умолчанию используется "%s".

source: Use any external ABF node or own external ABF node. Default is "%s".
ru: Использовать дополнительные ноды ABF - все или собственные. По умолчанию: "%s".

source: Do not check spec file.
ru: Не проверять spec-файл на корректность.

source: Initiate a chain of build tasks on ABF.
ru: Запустить цепочку сборочных заданий на ABF

source: Project name ([group/]project). If no group specified, it is assumed to be your default group. You can specify several projects to be built one after another. You can also group projects with ":" to indicate that they can be built in parallel. For example, "abf chain_build a b:c d" will build project "a", then (after "a" is built) will launch builds of "b" and "c" in parallel and after both of these projects are built, the build of "d" will be initiated. If automated publishing is set, then console client waits for every build to be published before starting the next build in the chain. If automated container creation is set, then console client waits for container to be ready and when the next build is started, containers from all previous builds are used as extra repositories.
ru: Имя проекта в формате ([группа/]проект). Если группа не указана, используется значение по умолчанию из вашиз настроек. Можно указать несколько проектов, которые должны собираться поочередно. Также можно группировать проекты с использованием символа ":" (без пробелов) для обозначение проектов, которые можно собирать параллельно. Например, "abf chain_build a b:c d" запустит сборку проекта "a", затем (если сборка "a" завершится успешно) одновременно запустит сборки "b" и "c", а после успешного завершения сборки этих проектов запустится сборка проекта "d". Если задана опция автоматической публикации результатов сборок, то перед запуском очередного звена цепочки консольный клиент будет дожидаться публикации всех сборок предыдущего звена. Если задано автоматическое создание контейнеров, то запуск для сборок очередного звена будут подключаться контейнеры всех сборок всех предыдущих звеньев.

source: File with project names. You can omit project names in command line and provide a file with project names instead. The file will be read line by line. All projects specified at the same line will be built in parallel; the next line will be processed only after all the build from the previous line are completed successfully. Project name in a line can be separated by colon (":") or by space symbols.
ru: Файл c именами проектов. Вы можете не указывать имена проектов в командной строке, а предоставить вместо этого файл с их именами. Каждая строчка соответсвует очередному звену в цепочке сборки. Сборки проектов, указанных в одной строчке, будут запускаться параллельно. Имена проектов в строке можно отделять друг от друга двоеточием либо пробелами.

source: number of seconds to sleep between successive checks of build status.
ru: число секунд, которые необходимо выждать перед очередной проверкой статуса сборок.

source: Build a project locally using mock.
ru: Собрать проект локально с использованием mock.

source: No checkouts will be made,the current git repository state will be used
ru: Для сборки используется текущее состояние Git-репозитория

source: A config template to use. Specify one of the config names from %s. Directory path should be omitted. If no config specified, "default.cfg" will be used
ru: Шаблон конфигурационного файла, который необходимо использовать. Укажите один из файлов из директории %s. Путь к директории указывать не надо. Если файл не указан, используется "default.cfg"

source: Build a project locally using rpmbuild.
ru: Собрать проект локально с использованием rpmbuild.

source: Build src.rpm (s), rpm (b) or both (a)
ru: Собрать src.rpm (s), rpm (b) или оба вида пакетов (a)

source: Publish the task that have already been built.
ru: Опубликовать успешно собранное сборочное задание.

source: The IDs of tasks to publish.
ru: Идентификаторы (ID) сборочных заданий для публикации.

source: Copy all the files from SRC_BRANCH to DST_BRANCH
ru: Копировать все файлы из SRC_BRANCH в DST_BRANCH

source: source branch
ru: ветка-источник

source: destination branch. If not specified, it's assumed to be the current branch
ru: ветка-приемник. Если не указана, используется текущая ветка

source: Create a tar.gz from the src_branch and put this archive and spec file to dst_branch
ru: Создать архив в формате tar.gz из ветки src_branch и положить этот архив вместе со spec-файлом в ветку dst_ranch

source: Send a pull request from SRC_BRANCH to DST_BRANCH
ru: Отправить запрос на изменение (pull request) из SRC_BRANCH в DST_BRANCH

source: source ref or branch
ru: ветка-источник

source: destination ref or branch
ru: ветка-приемник

source: Request title
ru: Краткое название запроса

source: Request body
ru: Описание изменений

source: Source project name (group/project).
ru: Имя проекта-источника (группа/проект).

source: Destination project name (group/project). If not specified, the source project is used (this can be used to send requests from one project branch to another).
ru: Имя проекта-приемника (владелец/проект). Если не указано, используется проект-источник (что может быть использовано для переносов изменений из одной ветки проекта в другую).

source: Fork existing project
ru: Клонировать существующий проект

source: project to fork (group/project)
ru: проект для клонирования (группа/проект).

source: target project group and name (group/project)
ru: группа и имя нового проекта (группа/проект)

source: Create alias of existing project
ru: Создать алиас для существующего проекта

source: Create empty project
ru: Создать пустой проект

source: project name
ru: имя проекта

source: who will own the project; default_owner is used by default
ru: кто будет владельцем проекта; по умолчанию используется значение default_owner

source: project description
ru: описание проекта

source: project visibility
ru: видимость проекта

source: Create project from SRPM
ru: Создать проект из SRPM

source: srpm file
ru: файл srpm

source: create additional branch; can be set more than once.
ru: создать дополнительную ветку; параметр может быть указан несколько раз.

source: Do not automatically create branch set as default in user config (if it is set to smth different from "master").
ru: Не создавать автоматически ветку, указанную как ветка по умолчанию в конфигурационном файле (только если эта ветка отлична от "master").

source: Destroy project
ru: Удалить проект

source: Add project to specified repository
ru: Добавить проект в указанный репозиторий

source: target repository ([platform/]repository)
ru: целевой репозиторий ([платформа/]репозиторий)

source: project name (group/project).
ru: имя проекта (группа/проект).

source: Remove project from specified repository
ru: Удалить проект из указанного репозитория

source: get a build-task status
ru: получить статус сборочного задания

source: If a project specified or you are in a git repository - try to get the IDs from the last build task sent for this project. If you are not in a git repository directory and project is not specified - try to get build IDs from the last build you've done with console client.
ru: Если указан проект или вы находитесь в директории Git-репозитория проекта, то будут использованы идентификаторы последних сборочных заданий, созданных для этого проекта. В противном случае, будут использованы идентификаторы последних сборочных заданий, запущенных с помощью консольного клиента.

source: build list ID
ru: идентификатор (ID) сборочного задания

source: Project. If last IDs for this project can be found - use them
ru: Проект. Если для этого проекта есть сохраненные идентификаторы сборочных заданий, использовать их
