Repository: OpenMandrivaSoftware/abf-console-client
Catalog: po/*.po
Languages: ru

source: Show one-line information including id, project, arch and status
ru: Показать краткую информацию (в одну строку) - идентификатор, проект, архитектуру и статус

source: Analyze spec file and show missing and unnecessary files from the current git repository directory.
ru: Проанализировать spec-файл и сообщить об отсутствующих и неиспользуемых файлах в Git-репозитории

source: automatically remove all the unnecessary files
ru: автоматически удалять все неиспользуемые файлы

source: Search for something on ABF.
ru: Поиск среди сущностей ABF

source: NOTE: only first 100 results of any request will be shown
ru: ВНИМАНИЕ: отображаются только первые 100 результатов

source: what to search for
ru: какую сущность искать

source: a string to search for
ru: строка, которую надо искать

source: get information about single instance
ru: получить информацию о конкретной сущности

source: type of the instance
ru: вид сущности

source: The filter may be specified by defining multiple pairs <type>.<attribute>=<value> or <attribute>=<value>, where <type> is one of the following positional arguments: %s, <attribute> is the one of the instance fields or special attribute (page - using for pagination) and <value> - string, that can take asterisk (*) or anything else... Example: abf info projects -f platforms.name=rosa2012lts page=*
ru: Можно задать фильтр, указав набор пар <вид>.<атрибут>=<значение> или <атрибут>=<значение>, где <вид> - одно из значений: %s, <атрибут> - один из атрибутов сущности данного вида либо специальный атрибут ('page' - используется для вывода заданных страниц поиска), а <значение> - строка, в роли которой можно указать символ '*' для вывода всех значений. Например: abf info projects -f platforms.name=rosa2012lts page=*

source: output format
ru: формат вывода

source: Execute a set of internal datamodel tests
ru: Запустить набор внутренних тестов для модели данных

source: Filter can be specified with the following parameters: %s
ru: Фильтр может быть использован со следующими параметрами: %s

source: Filter setup for instance %s
ru: Настройка фильтра для сущности %s

source: Output format can be specified with the following parameters: %s
ru: Формат вывода может быть задан с помощью следующих параметров: %s

source: Using default query format: %s
ru: Используется формат запроса по умолчанию: %s

source: Parameter %s not available:
ru: Параметр %s недоступен:

source: To set up a default configuration file, symbolic link in /etc/abf/mock-urpm/configs have to be created. I need sudo rights to do it.
ru: Чтобы настроить конфигурационный файл, необходимо создать символьную ссылку в /etc/abf/mock-urpm/. Для этого необходимы права root.

source: Avaliable configurations:
ru: Досутпные конфигурации:

source: "%s" is not a valid configuration.
ru: "%s" не является корректной конфигурацией.

source: Select one (it will be remembered):
ru: Выберите одно из значений (выбор будет запомнен):

source: Config file %s can not be found.
ru: Не могу найти конфигурационный файл %s.

source: You should create this file or a symbolic link to another config in order to execute 'abf mock-urpm' without --config
ru: Вы должны создать такой файл или ссылку, чтобы запускать 'abf mock-urpm' без указания опции --config

source: Could not read the contents of '%(path)s': %(exception)s
ru: Не могу прочитать содержимое '%(path)s': %(exception)s

source: Can not locate a spec file in %s
ru: Не могу найти spec-файл в %s

source: Executing mock-urpm...
ru: Запускается mock-urpm

source: Can not execute mock-urpm (%s). Maybe it is not installed?
ru: Не могу запустить mock-urpm (%s). Возможно, он не установлен?

source: Could not find a single src.rpm file in %s
ru: Не могу найти файл src.rpm в %s для обработки

source: No aliases found
ru: Синонимов не найлено

source: Not enough options. Use it like "abf alias add <alias_name> opt1 [opt2 ...]"
ru: Недостаточно опций. Формат использования команды: "abf alias add <alias_name> opt1 [opt2 ...]"

source: Do not use " " or "=" for alias name!
ru: Не используйте " " или "=" для названий синонимов!

source: Alias "%s" already exists and will be overwritten.
ru: Синоним "%s" уже существует и будет перезаписан.

source: Enter the alias name!
ru: Введите название синонима!

source: Alias "%s" not found
ru: Синоним "%s" не найден

source: RPMBUILD started
ru: Начинаем выполнять задачу RPMBUILD

source: Executing rpmbuild...
ru: Запускается rpmbuild

source: Can not execute rpmbuild (%s). Maybe it is not installed?
ru: Не могу запустить rpmbuild (%s). Возможно, он не установлен?

source: Saving build folders to current directory...
ru: Перемещаем сборочные артефакты в текущую директорию...

source: Moving files to the current directory...
ru: Перемещаем файлы в текущую директорию...

source: SEARCH started
ru: Начинаем выполнять задачу SEARCH

source: The project format is "[owner_name/]project_name"
ru: Проект должен быть указан в формате "[владелец/]название"

source: The project group is assumed to be
ru: Будет использована группа:

source: You are not in a git repository directory. Specify the project name please!
ru: Вы не находитесь внутри директории Git-репозитория. Пожалуйста, укажите имя проекта!

source: The project %(owner)s/%(project)s does not exist!
ru: Проект %(owner)s/%(project)s не существует!

source: You do not have acces to the project %(owner)s/%(project)s!
ru: У вас нет доступа к проекту %(owner)s/%(project)s!

source: Project: %s
ru: Проект: %s

source: Failed to get ID for user
ru: Не удалось получить идентификатор пользователя

source: Platform is assumed to be
ru: Будет использована платформа:

source: repository argument format: [platform/]repository
ru: репозиторий должен быть указан в формате [платформа/]репозиторий

source: Platform %s doesn't exists!
ru: Платформа "%s" не существует!

source: Repository %s doesn't exists!
ru: Репозиторий "%s" не существует!

source: GET started
ru: Начинаем выполнять задачу GET

source: Specify a project name as "group_name/project_name" or just "project_name"
ru: Укажите имя проекта в формате "имя_группы/имя_проекта" или просто "имя_проекта"

source: Branch
ru: Ветка

source: DESTROY started
ru: Запускается задача DESTROY

source: PUT started
ru: Начинаем выполнять задачу PUT

source: You have to be in a git repository directory
ru: Вы должны находиться в директории Git-репозитория

source: Incorrect "--minimal-file-size" value: %s
ru: Нукорректное значение "--minimal-file-size": %s

source: There were errors while uploading, stopping.
ru: При загрузке произошли ошибки, останавливаем работу.

source: Commited.
ru: Изменения зафиксированы.

source: Pushed
ru: Изменения отправлены на сервер.

source: FETCH started
ru: Начинаем выполнять задачу FETCH

source: Fetching file with hash
ru: Извлекаем файл с хэш-суммой

source: File "%s" can not be found
ru: Файл "%s" не найден

source: Invalid yml file %(filename)s! Problem in line %(line)d column %(column)d: %(problem)s
ru: Некорректный yml-файл %(filename)s! Проблема в строке %(line)d, колонке %(column)d: %(problem)s

source: Invalid yml file %(filename)s! %(exception)s
ru: Некорректный yml-файл %(filename)s! %(exception)s

source: REMOTE started
ru: Начинаем выполнять задачу REMOTE

source: Fail to detect project name
ru: Не удалось определить имя проекта.

source: STORE started
ru: Начинаем выполнять задачу STORE

source: File "%s" does not exist!
ru: Файл "%s" не существует!

source: "%s" is not a regular file!
ru: "%s" не является обычным файлом!

source: COPY started
ru: Начинаем выполнять задачу COPY

source: You are not in a git directory
ru: Вы находитесь вне директории Git-репозитория

source: Current branch is
ru: Текущая ветка:

source: Source and destination branches shold be different branches!
ru: Ветка-источник и ветка-приемник должны быть разными!

source: Repository root folder is
ru: Корневой каталог репозитория:

source: Checking out the initial branch (%s)
ru: Переключаемся на исходную ветку (%s)

source: PULL REQUEST started
ru: Начинаем выполнять задачу PULL REQUEST

source: FORK PROJECT started
ru: Начинаем выполнять задачу FORK PROJECT

source: No group named '%s', will fork to your personal platform
ru: Группы %s не существует, клонируем в вашу персональную платформу

source: Incorrect target group
ru: Некорректная группа

source: ALIAS PROJECT started
ru: Начинаем выполнять задачу ALIAS PROJECT

source: No group named '%s', will create alias in your personal platform
ru: Группы %s не существует, алиас будет создан в вашей персональной платформу

source: CREATE EMPTY PROJECT started
ru: Начинаем выполнять задачу CREATE EMPTY PROJECT

source: Incorrect owner data
ru: Некорректные данные о владельце

source: CREATE PROJECT started
ru: Начинаем выполнять задачу CREATE PROJECT

source: Failed to get information from SRPM
ru: Не удалось извлечь информацию из SRPM

source: ADD PROJECT TO REPO started
ru: Начинаем выполнять задачу ADD PROJECT TO REPO

source: REMOVE PROJECT FROM REPO started
ru: Начинаем выполнять задачу REMOVE PROJECT FROM REPO

source: CHAIN_BUILD started
ru: Начинаем выполнять задачу CHAIN_BUILD

source: You can't specify '-i' option and project names in command line at the same time.
ru: Нельзя одновременно указать опцию '-i' и задать имена проектов в командной строке.

source: Launching build of %s
ru: Запускаем сборку %s

source: One of the tasks failed, aborting chain build
ru: Одно из заданий завершилось неудачно, останавливаем цепочку

source: Container creation failed for build %d, aborting chain build
ru: Создание контейнера для сборки %d завершилось неудачно, останавливаем цепочку

source: WARNING: Build %d was not published and container was not created
ru: ПРЕДУПРЕЖДЕНИЕ: Сбокра %d не была опубликована и для нее не был создан контейнер

source: BUILD started
ru: Начинаем выполнять задачу BUILD

source: You've specified a project name without branch, tag or commit (-b, -t or -c)
ru: Вы указали имя проекта без ветки, тэга или коммита (-b, -t или -c)

source: You should specify ONLY ONE of the following options: branch, tag or commit.
ru: Вы можете использовать только одну из опций 'branch' (-b), 'tag' (-t) или 'commit' (-c)

source: The project %s is not a package and can not be built.
ru: Проект %s не является пакетом и не может быть собран.

source: You've specified a project without a branch.
ru: Вы указали проект без ветки

source: Could not resolve hash for branch '%s'
ru: Не могу получить хэш для ветки '%s'

source: Could not resolve a platform to save to from the branch name "%s".
ru: Не могу автоматически определить платформу, для которой надо собирать проект из ветки "%s".

source: A list of options which could be resolved automatically: %s
ru: Список опций, значения для которых могут быть выставлены автоматически: %s

source: Git branch, tag or commit can not be resolved automatically. Specify it by -b, -t or -c.
ru: Не могу автоматически определить ветку, тэг или коммит Git. Укажите одно из этих значений с помощью опций -b, -t or -c.

source: Could not resolve hash for %(ref_type)s '%(to_resolve)s'
ru: Не могу получить хэш для %(ref_type)s '%(to_resolve)s'

source: Autoresolved options were rejected.
ru: Опции, выбранные автоматически, использованы не будут.

source: Git commit hash: %s
ru: Хэш коммита в Git: %s

source: Save-to platform is assumed to be %s
ru: Целевая платформа сборки: %s

source: Save-to repository can not be resolved automatically. Specify it (-s).
ru: Не могу автоматически определить целевой репозиторий сборки. Укажите его с помощью опции '-s'

source: save-to-repository option format: [platform/]repository
ru: формат опции save-to-repository: [платформа/]репозиторий

source: Can not build for platform %(platform)s. Select one of the following: %(all_platforms)s
ru: Не могу запустить сборку для платформы %(platform)s. Выберите одну из следующих: %(all_platforms)s

source: Incorrect save-to repository %(platform)s/%(repo)s. Select one of the following: %(all_repos)s
ru: Нкорректный целевой репозиторий %(platform)s/%(repo)s. Выберите один из следующих: %(all_repos)s

source: Save-to repository:
ru: Цулувой репозиторий сборки:

source: Platform for selected repository %(repo)s is assumed to be %(plat)s
ru: Для репозитория %(repo)s выбрана платформа %(plat)s

source: 'repository' option format: [platform/]repository
ru: формат значения опции 'repository': [платформа/]репозиторий

source: Can not use build repositories from platform %(platform)s! Select one of the following: %(all_plats)s
ru: Не могу использовать репозитории из платформы %(platform)s! Выберите одну из следующих платформ: %(all_plats)s

source: Platform %(plat)s does not have repository %(repo)s! Select one of the following: %(all_repos)s
ru: У платформы %(plat)s нет репозитория %(repo)s! Выберите один из следующих: %(all_repos)s

source: Could not resolve repositories to build with. Please specify it (-r option)
ru: Не могу определить репозитории, которые надо подключить при сборке. Пожалуйста, укажите их с помощью опции '-r'

source: Repositories to build with are assumed to be:
ru: Выбраны репозитории, подключаемые для сборки:

source: You have to specify the repository(s) to build with (-r option)
ru: Вам необходимо вручную указать репозитории, которые надо подключить при сборке, с помощью опции '-r'.

source: Build repositories:
ru: Репозитории, подключаемые при сборке:

source: Invalid architecture: %s
ru: Некорректная архитектура: %s

source: Arches are assumed to be
ru: Выбраны архитектуры:

source: Architectures: %s
ru: Архитектуры: %s

source: The status of build task %(id)s is "%(status)s", can not published!
ru: Статус сборочного задания %(id)s - "%(status)s", не могу опубликовать!

source: Could not publish task %(id)s: %(exception)s
ru: Не могу опубликовать задачу %(id)s: %(exception)s

source: Can not read buildlist %(id)s: %(exception)s
ru: Не могу прочитать данные о сборочном листе %(id)s: %(exception)s

source: Buildlist ID:
ru: Идентификатор (ID) сборочного листа:

source: Project:
ru: Проект:

source: Status:
ru: Статус:

source: Container path:
ru: Путь к контейнеру:

source: Container status:
ru: Статус контейнера:

source: Build for platform:
ru: Собрать для платформы:

source: Save to repository:
ru: Сохранить в репозиторий:

source: Build repositories:
ru: При сборке подключить репозитории:

source: Extra repositories:
ru: Дополнительные репозитории:

source: Architecture:
ru: Архитектура:

source: Created at:
ru: Создан:

source: Updated at:
ru: последнее обновление статуса:

source: LOG Url:
ru: Журнал:

source: Chroot Tree:
ru: Листинг файлов сборочного окружения:

source: STATUS started
ru: Начинаем выполнять задачу STATUS

source: Can not find last build IDs. Specify a project name or ID
ru: Не могу определить идентификаторы последних сборочных заданий. Укажите идентификатор или имя проекта

source: "%s" is not a number
ru: "%s" не является числом

source: Updating project location for %s
ru: Обновляем метоположение проекта - %s

source: Project %(proj)s has been located in %(path)s
ru: Проект %(proj)s найден в %(path)s

source: LOCATE started
ru: Начинаем выполнять задачу LOCATE

source: To show a project location, you have to specify a project name ('-p' option)
ru: Чтобы узнать местоположение проекта, необходимо указать имя проект (опция '-p')

source: error: the project format is "[owner_name/]project_name"
ru: ошибка: формат проекта - "[владелец/]имя"

source: error: project %s can not be located
ru: ошибка: проект %s не может быть найден

source: error: project is not located in "%s" anymore
ru: ошибка: в "%s" проекта больше нет

source: Please specify 'true' or 'false' for %s
ru: Пожалуйста, укажите для %s значение 'true' или 'false'

source: UPDATE started
ru: Начинаем выполнять задачу UPDATE

source: SHOW started
ru: Начинаем выполнять задачу SHOW

source: CLEAN started
ru: Начинаем выполнять задачу CLEAN

source: non-critical error in config "%(path)s": %(exception)s
ru: некритическая ошибка в конфигурационном файле "%(path)s": %(exception)s

source: error in config "%(path)s": %(exception)s
ru: ошибка в конфигурационном файле "%(path)s": %(exception)s

source: Configuration schema have been changed or config file have been corrupted, rebuilding config...
ru: Схема файла конфигурации была изменена либо файл поврежден, перезапускаем настройку конфигурации

source: No protocol part specified (http://, https://, etc.)
ru: Не указан тип протокола (http://, https://, и т.д.)

source: Double slash must present only once (in a protocol part)
ru: Двойной слэш должен быть указан только один раз (при указании типа протокола)

source: Configuration have been completed
ru: Конфигурация успешно завершена

source: Now you can execute "abf locate update-recursive -d PATH", where PATH is your directory with cloned ABF projects. It will let you use "abfcd <project>" command to simply cd to project directory.
ru: Теперь вы можете запустить "abf locate update-recursive -d PATH", где PATH - это ваша директория с клонированными проектами ABF. Это позволит вам использовать команду "abfcd <project>" для перехода в директорию проекта.

source: Cloning git repository (temporary workaround)
ru: Клонирование Git-репозитория (временная реализация)

source: Temporary directory is
ru: Временная директория:

source: Spec files found:
ru: Найдены spec-файлы:

source: Could not find single spec file
ru: Не могу определить, какой spec-файл использовать

source: No path specified and you are not in a git repository
ru: Не указан путь и вы не находитесь в директории Git-репозитория

source: No spec files found!
ru: Не найдены spec-файлы!

source: More than one spec file found!
ru: Найдено больше одного spec-файла!

source: Invalid yml file %(file)s! Problem in line %(line)d column %(col)d: %(exception)s
ru: Некорректный yml-файл %(file)s! Проблема в строке %(line)d, колонке %(col)d: %(exception)s

source: Invalid yml file %(file)s! %(exception)s
ru: Некорректный yml-файл %(file)s! %(exception)s

source: Incorrect .abf.yml file: no 'sources' key
ru: Некорректный файл .abf.yml: отсутсвует ключ 'sources'

source: warning: directory '%s' was found
ru: предупреждение: директория '%s' не существует

source: warning: file "%s" is listed in spec as a URL, but does not present in the current directory or in .abf.yml file
ru: предупреждение: файл "%s" указан в spec-файле как внешняя ссылка, но не присутсвует ни в текущей директории, ни в файле .abf.yml

source: warning: file "%s" presents in the git directory and in .abf.yml
ru: предупреждение: файл "%s" присутсвует и в Git-репозитории, и в файле .abf.yml

source: error: missing file %s
ru: ошибка: отсутсвует файл %s

source: warning: unnecessary file "%s"
ru: предупреждение: неиспользуемый файл - "%s"

source: warning: unnecessary file "%s" in .abf.yml
ru: предупреждение: неиспользуемый файл "%s" в .abf.yml

source: .abf.yml file was rewritten
ru: файл .abf.yml был перезаписан

source: Could not resolve project name and version from the spec file
ru: Не могу определить имя и версию проекта на основе spec-файла

source: Project name is
ru: Имя проекта:

source: Project version is
ru: Версия проекта:

source: Writing %(path)s/%(tarball)s ...
ru: Записывается %(path)s/%(tarball)s ...

source: Removing files except
ru: Удаляются все файлы, кроме

source: Executing command: %s
ru: Запускается команда: %s

source: Process execution has been terminated
ru: выполнение процесса было прервано

source: Timeout(%(timeout)s) expired for command: # %(cmd)s %(output)s
ru: Истекло время ожидания (%(timeout)s) для команды: # %(cmd)s %(output)s

source: Child returncode was: %s
ru: Код возврата дочернего процесса: %s

source: Command failed. Return code: %(ret_code)s Output: %(output)s
ru: Команда завершилась с ошибкой. Код возврата: %(ret_code)s Вывод: %(output)s

source: Magic type of file %(path)s is %(type)s
ru: Тип файла %(path)s - %(type)s

source: Incorrect .abf.yml file: no 'sources' key.
ru: Некорректный файл .abf.yml: отсутсвует ключ 'sources'

source: Fetching file %s
ru: Извлекаем файл %s

source: The file %s already presents and has a correct hash
ru: Файл %s уже существует и имеет корректную хэш-сумму

source: The file %s already presents but its hash is not the same as in .abf.yml, so it will be rewritten.
ru: Файл %s уже присутсвует, но его хэш-сумма отличается от указанной в .abf.yml, поэтому он будет перезаписан.

source: error:
ru: ошибка:

source: Could not parse .abf.yml file. It seems to be corrupted and will be rewritten.
ru: Не могу считать файл .abf.yml. Он поврежден и будет перезаписан.

source: Incorrect .abf.yml file: no 'sources' key. The file will be rewritten.
ru: Некорректный файл .abf.yml: отсутсвует ключ 'sources'. Файл будет перезаписан.

source: File %s not found, URL will be used instead. Skipping.
ru: Файл %s не найден, при сборке будет использоваться ссылка. Пропускаем.

source: error: Source%(num)d file %(source)s does not exist, skipping!
ru: ошибка: файл %(source)s (Source%(num)d) не существует, пропускаем!

source: File %s not found, but it's listed in .abf.yml. Skipping.
ru: Файл %s не найден, но перечислен в .abf.yml. Пропускаем.

source: Size of %s is 0, skipping
ru: %s имеет нулевой размер, пропускаем

source: Size of %s less then minimal, skipping
ru: Размер %s меньше минимального порога, пропускаем

source: File %s is textual, skipping
ru: Файл %s является текстовым, пропускаем

source: Hash for file %s has been updated
ru: Обновлена хэш-сумма для файла %s

source: Removing %(item)s:%(hash)s from .abf.yml
ru: Удаляем %(item)s:%(hash)s из .abf.yml

source: Hash for file %s is already correct
ru: .abf.yml уже содержит корректню хэш-сумму для файла %s

source: File %s has been processed
ru: Файл %s успешно обработан

source: Removing file %s
ru: Удаляется файл %s

source: Writing the new .abf.yml file...
ru: Записывается новый фал .abf.yml

source: can't interpret %r
ru: не могу интерпретировать %r

source: File-store URL has to start with "http://"
ru: Ссылка на файловое хранилище должна начинаться с "http://"

source: Internal server error: it has returned non-json data.
ru: Внутренняя ошибка сервера: он вернул данные не в формате json.

source: Unknown server error:
ru: Неизветсная ошибка сервера:

source: Sorry, but something went wrong and request I've sent to ABF is bad. Please, notify developers, send them a set of command-line arguments and the request data: %(url)s %(json)s
ru: Что-то пошло не так и на ABF был отправлен некорректный запрос. Пожалуйста, сообщите об этом разработчикам консольного клиента. Пошлите им перечень аргументов, с которыми был запущен клиент, и данные запроса: %(url)s %(json)s

source: Fetching url %s
ru: Скачиваем ссылку %s

source: It was cached! ETag:
ru: Найдено в кэше! ETag:

source: Getting cached result (cache was validated)
ru: Получаем результат из кэша (кэш был проверен на актуальность)

source: Return code:
ru: Код возврата:

source: Authorization failed. Incorrect username or password
ru: Авторизация не удалась. Неверный логин или пароль

source: Caching the new value for %(url)s. ETag is %(etag)s
ru: Помещаем в кэш новое значение для %(url)s. Значени ETag: %(etag)s

source: Looking for "%s" in file-store...
ru: Ищем "%s" в файловом хранилище...

source: File hash is %s
ru: Хэш-сумма файла: %s

source: File-Store returned file for sha1 %(new)s instead of %(old)s!
ru: Файловое хранилище вернуло файл для sha1-суммы %(new)s вместо %(old)s!

source: The name of the file in file-store is %(old)s, but you are trying to upload file %(new)s
ru: В файловом хранилище имеется файл с именем %(old)s, а вы пытаетесь загрузить файл %(new)s

source: Uploading %(file)s (%(size)s)
ru: Загружается %(file)s (%(size)s)

source: Could not upload file. HTTP error %(status)s %(reason)s
ru: Не омгу загрузить файл. Ошибка HTTP: %(status)s %(reason)s
